{
    "personalInfo": {
        "name": "Shashank Kumar",
        "title": "AI Systems Engineer | Full-Stack Developer | AI Training Specialist",
        "location": "Baraut, Baghpat, India",
        "email": "shashankchoudhry792@gmail.com",
        "github": "sidthebuilder",
        "githubUrl": "https://github.com/sidthebuilder",
        "portfolioUrl": "https://sidthebuilder.github.io/Portfolio/",
        "tagline": "Available for worldwide freelance and contract engagements"
    },
    "professionalSummary": "AI Systems Engineer and Full-Stack Developer with 4+ years of experience architecting intelligent systems and scalable applications. Delivered measurable impact by improving model safety by 25%, building AI agents with 85% task accuracy, and engineering solutions that drove 150% client growth. Combines expertise in LLM fine-tuning, multi-agent architecture, and production-grade deployment.",
    "coreCompetencies": [
        "Large Language Models (LLMs)",
        "Multi-Agent Systems",
        "RAG Pipelines",
        "FastAPI",
        "Next.js",
        "React",
        "Docker",
        "Python"
    ],
    "technicalSkills": {
        "Languages": "Python, JavaScript, TypeScript, C#, SQL",
        "Frontend": "React, Next.js, TailwindCSS",
        "Backend": "FastAPI, Flask, Node.js, Express",
        "Databases": "PostgreSQL, MongoDB, Supabase",
        "AI/ML": "OpenAI API, Hugging Face, LLM Evaluation, RLHF",
        "Tools": "Docker, n8n, GitHub Actions"
    },
    "experience": [
        {
            "role": "AI Training and Evaluation Specialist",
            "company": "Contract for AI Research Platforms (via Upwork, Outlier, OneForma)",
            "period": "2024 - Present",
            "details": [
                "Improved model safety scores by 25% by designing and executing 500+ adversarial prompts for red-teaming frontier LLMs.",
                "Accelerated data pipeline efficiency by 30% by creating annotation scripts and ontology systems for 10,000+ multilingual NLP samples, maintaining 98% QA accuracy.",
                "Trained and evaluated 3+ major LLMs on reasoning and code-generation tasks, directly contributing to production release cycles.",
                "Consistently rated Top Performer (top 5%) across 1,000+ complex evaluation tasks."
            ]
        },
        {
            "role": "AI Training Specialist & Voice Artist",
            "company": "Outlier AI",
            "period": "2022 - Present",
            "details": [
                "Annotated and QA-validated 10,000+ multilingual NLP training samples, speech recognition, and voice AI systems with 98% accuracy rate.",
                "Designed and implemented ontology management systems for optimizing LLM and voice AI training data consistency and quality across multiple domains.",
                "Led prompt complexity evaluation initiatives and metadata accuracy reviews for frontier AI models, improving model alignment and safety.",
                "Conducted specialized voice annotation for speech-to-text and voice recognition models across 20+ languages."
            ]
        },
        {
            "role": "AI Trainer and Evaluator",
            "company": "OneForma",
            "period": "2023 - Present",
            "details": [
                "Conducted LLM evaluation and fine-tuning for conversational AI applications, focusing on response quality, safety alignment, and user satisfaction metrics.",
                "Developed comprehensive training protocols for prompt engineering, model ranking, and AI alignment workflows based on industry best practices.",
                "Completed 500+ evaluation tasks with zero rejections, earning Top Performer status."
            ]
        },
        {
            "role": "Freelance Full-Stack Developer",
            "company": "Fiverr and Direct Clients",
            "period": "2020 - 2024",
            "details": [
                "Designed and built 30+ custom WordPress and Webflow websites integrated with AI chatbot solutions, CRM systems, and advanced automation workflows.",
                "Developed full-stack applications using Python, Flask, JavaScript, React, and Node.js from database schema to responsive frontend deployment with 99% uptime.",
                "Implemented advanced SEO strategies resulting in 150% organic traffic growth for 20+ client projects.",
                "Automated 500+ customer service and business workflows using n8n, REST APIs, and third-party integrations, processing 1000+ monthly transactions."
            ]
        }
    ],
    "projects": [
        {
            "name": "Verdant AI: Multi-Agent Orchestration System",
            "url": "https://github.com/sidthebuilder/verdant-ai",
            "stack": "Python, FastAPI, Next.js 14, Genesis Physics Engine, Docker, RESTful APIs",
            "description": "High-performance multi-agent orchestration system designed for complex problem-solving domains including physics simulation, time-series forecasting, and autonomous code generation. Production-grade system.",
            "bullets": [
                "Router-Delegate Architecture with central intelligence engine routing tasks to specialized micro-agents",
                "Robust Adapter Pattern wrapping complex research modules in fault-tolerant adapters for stability",
                "Micro-Agent Swarm with specialized agents for Coding, Mathematics, Creative Writing, Web Research, and Physics Simulation",
                "Full-Stack Implementation with FastAPI backend, Next.js 14 frontend, Docker containerization, and microservices"
            ]
        },
        {
            "name": "NeuroSim Engine: Advanced AI Character Simulation System",
            "url": "https://github.com/sidthebuilder/-NeuroSim-Engine",
            "stack": "Python, Isaac Sim, USD, PhysX, Behavior Trees, Emotion Modeling Systems",
            "description": "Advanced AI character simulation system featuring emotional intelligence, decision-making AI, and dynamic behavior modeling for game development and interactive simulations.",
            "bullets": [
                "Traits and Emotions System with comprehensive framework for psychologically realistic AI characters",
                "Goals and Desires Engine providing motivation-based AI driving character actions",
                "Decision-Making AI with advanced behavior modeling using conditional branching and emotion trees",
                "Physics Integration with Isaac Sim USD and PhysX engine for physics-based AI training scenarios"
            ]
        },
        {
            "name": "GMX TradeDesk: DeFi Trading Automation",
            "url": "https://github.com/sidthebuilder/gmx-v2-arbitrum-trader",
            "stack": "Python, Flask, Web3.py, PyQt5",
            "description": "Desktop application for automated trading strategies on GMX V2 perpetuals exchange.",
            "bullets": [
                "Developed real-time position manager with sub-100ms execution latency",
                "Built backtesting engine simulating 500+ historical trading scenarios"
            ]
        },
        {
            "name": "Isaac Sim Physics: Breakable Object Simulation",
            "url": "https://github.com/sidthebuilder/Isaac-fishing-rod",
            "stack": "Python, NVIDIA Isaac Sim, PhysX",
            "description": "Robotics training environment simulating complex breakage dynamics for ML data generation.",
            "bullets": [
                "Generated 1,000+ synthetic training samples at 60 FPS",
                "Modeled complex D6 joint dynamics for realistic breakage simulation"
            ]
        },
        {
            "name": "Solar Phantom: Drone Optimization",
            "url": "https://github.com/sidthebuilder/Solar-Phantom",
            "stack": "Python, SciPy, Physics Modeling, Data Analysis",
            "description": "Optimization framework for solar-powered autonomous drones.",
            "bullets": [
                "Optimized energy consumption models for 24-hour continuous flight",
                "Unified physics calculations improving simulation accuracy by 30%"
            ]
        }
    ],
    "education": [
        {
            "institution": "University of the People",
            "degree": "Bachelor of Science in Computer Science",
            "year": "2025 - Present",
            "status": "In Progress"
        },
        {
            "institution": "Subharti University",
            "degree": "Bachelor of Arts",
            "year": "2022 - March 2025"
        },
        {
            "institution": "Dr. B. R. Ambedkar University",
            "degree": "Diploma in Dental Hygiene",
            "year": "2021 - 2023"
        }
    ],
    "certifications": [
        "CS50: Introduction to Computer Science, Harvard University (edX), 2024",
        "Google Analytics Certification, Google Digital Garage, 2023",
        "Google Ads Certification, Google Digital Garage, 2023",
        "Digital Marketing Certification, Google Digital Garage, 2023",
        "Scale AI Annotation Specialist Certification, 2022",
        "Advanced Prompt Engineering for LLMs, Self-certified through 100+ production projects, 2024"
    ],
    "additionalInfo": [
        "Languages: English (Fluent), Hindi (Native)",
        "GitHub Portfolio: 9 active repositories with Verdant AI and NeuroSim Engine",
        "Upwork Profile: 4.8+ rating, 100% repeat rate",
        "Outlier AI Status: Certified Specialist with 10,000+ completed annotations",
        "OneForma Status: Top Performer with zero rejections",
        "Engagement Model: Flexible pricing based on project scope, complexity, and timeline"
    ]
}